app/controllers/admin/customers_controller.rb

  def index
    @customers = Customer.page(params[:page]).per(10)
---
SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def show
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    customer = Customer.find(params[:id])
    customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["telephone_number", "09012234557"], ["updated_at", "2021-10-25 09:28:59.311319"], ["id", 1]]