app/controllers/admin/genres_controller.rb

  def index
    @genre = Genre.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    genre = Genre.new(genre_params)
    genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ケーキ"], ["created_at", "2021-10-22 08:34:35.609444"], ["updated_at", "2021-10-22 08:34:35.609444"]]

  def edit
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]