app/controllers/admin/items_controller.rb

  def index
    @items = Item.page(params[:page]).per(10)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"