app/controllers/admin/items_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @item = Item.new
    @genres = Genre.all

INSERT INTO "items" ("name", "image_id", "introduction", "price", "created_at", "updated_at", "genre_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @item = Item.find(params[:id])
    @genre = Genre.find(@item.genre_id)

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
  def edit
    @item = Item.find(params[:id])
    @genre = Genre.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "f45c41d5362f3d677f93d9083cb108e041299d566dd8fc87fc5b4f473e30"], ["introduction", "たっぷりのクリームが入っています。"], ["updated_at", "2021-10-25 09:03:35.237715"], ["id", 1]]
---
  def update
    item = Item.find(params[:id])
    item.update(item_params)