app/views/admin/orders/index.html.erb

        <td><%= order.customer.name %></td>
        <td><%= order.order_items.sum(:amount) %></td>
---
SELECT "orders".* FROM "orders"
SELECT SUM("order_items"."amount") FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]