app/views/admin/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
        </thead>
        <% @order.order_items.each do |order_item| %>