app/controllers/public/homes_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" IN (?, ?, ?, ?)  [["id", 1], ["id", 2], ["id", 3], ["id", 4]]
---
  def top
    @items = Item.find(1,2,3,4)