app/controllers/public/homes_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."is_active" = ? ORDER BY "items"."updated_at" DESC LIMIT ?  [["is_active", 1], ["LIMIT", 4]]
---
  def top
    @items = Item.where(is_active: 'true').order(updated_at: :desc).limit(4)