app/controllers/public/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."is_active" = ? LIMIT ? OFFSET ?  [["is_active", 1], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."is_active" = ?  [["is_active", 1]]
---
  def index
    @items = Item.where(is_active: 'true').page(params[:page]).per(4)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @item = Item.find(params[:id])