app/controllers/public/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all