app/controllers/public/orders_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def new
    @order = Order.new
    @addresses = Address.all

SELECT "cart_items".* FROM "cart_items"
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def confirm
    @cart_items = CartItem.all
    @total = 0
    @order = Order.new(order_params)
    if params[:order][:address] == "0"
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.name

      elsif params[:order][:address] == "1"
      @address = Address.find(params[:order][:address_id])
      @order.address = @address.address
      @order.postal_code = @address.postal_code
      @order.name = @address.name

      elsif params[:order][:address] == "2"
      @order.address = params[:order][:new_address]
    end
    @order.customer_id = current_customer.id
    @order.postage = 800
    @order.billing_amount = @order.postage + @cart_items.sum{ |cart_item| cart_item.subtotal }

INSERT INTO "orders" ("name", "postal_code", "address", "payment", "billing_amount", "postage", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items"
INSERT INTO "order_items" ("price", "amount", "created_at", "updated_at", "item_id", "order_id") VALUES (?, ?, ?, ?, ?, ?)  [["price", 280], ["amount", 3], ["created_at", "2021-10-25 03:58:12.777267"], ["updated_at", "2021-10-25 03:58:12.777267"], ["item_id", 3], ["order_id", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]
---
  def create
    order = Order.new(order_params)
    order.save
    cart_items = CartItem.all
    cart_items.each do |cart_item|
      order_item = OrderItem.new
      order_item.order_id = order.id
      order_item.item_id = cart_item.item.id
      order_item.price = cart_item.item.price
      order_item.amount = cart_item.amount
      order_item.save
    end
    cart_items.destroy_all

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])