app/controllers/address_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @address = Address.new
    @addresses = Address.all

INSERT INTO "addresses" ("name", "postal_code", "address", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "綾小路彩乃"], ["postal_code", "1234569"], ["address", "広島県広島市"], ["created_at", "2021-10-25 07:13:42.834608"], ["updated_at", "2021-10-25 07:13:42.834608"], ["customer_id", 2]]
---
  def create
    address = Address.new(address_params)
    address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @address = Address.find(params[:id])

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "広島県尾道市"], ["updated_at", "2021-10-25 07:22:32.962009"], ["id", 1]]
---
  def update
    address = Address.find(params[:id])
    address.update(address_params)