app/controllers/cart_items_controller.rb

  def create
    @cart_items = CartItem.all
    @cart_item = CartItem.new(cart_item_params)
    @cart_items.each do |cart_item|
      if cart_item.item_id == @cart_item.item_id
        cart_item.amount += @cart_item.amount
        cart_item.update_attribute(:amount, cart_item.amount)
        @cart_item.destroy
      end
    end
    @cart_item.save
---
SELECT "cart_items".* FROM "cart_items"
INSERT INTO "cart_items" ("amount", "created_at", "updated_at", "item_id", "customer_id") VALUES (?, ?, ?, ?, ?)  [["amount", 2], ["created_at", "2021-10-25 02:24:10.996859"], ["updated_at", "2021-10-25 02:24:10.996859"], ["item_id", 1], ["customer_id", 2]]

  def index
    @cart_items = CartItem.all
---
SELECT "cart_items".* FROM "cart_items"

  def update
    cart_item = CartItem.find(params[:id])
    cart_item.update(cart_item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2021-10-25 12:12:53.321894"], ["id", 7]]

  def destroy
    cart_item = CartItem.find(params[:id])
    cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def empty
    cart_items = CartItem.all
    cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items"
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]