app/views/public/orders/index.html.erb

        <td class="align-middle">
          <% order.order_items.each do |order_item| %>
---
SELECT "orders".* FROM "orders"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]