app/views/public/orders/show.html.erb

          <td>
            <% @order.order_items.each do |order_item| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]