app/views/public/items/index.html.erb

<div class="container">
  <h2>商品一覧(全<%= Item.where(is_active: 'true').count %>件)</h2>
---
SELECT COUNT(*) FROM "items" WHERE "items"."is_active" = ?  [["is_active", 1]]